Revit 2024 API
ExternalApplicationArray.Clear Method
Removes every item from the array, rendering it empty.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual void Clear()
Visual Basic
Public Overridable Sub Clear
Visual C++
public:
virtual void Clear()
See Also
ExternalApplicationArray Class
Autodesk.Revit.UI Namespace